export const creams = [
    {
        id: 1,
        title: "Пептиды",
        subtitle: "Омолаживающий крем для лица и век с пептидами",
        weight: "30 мл",
        description: "Откройте для себя секрет молодости и сияния с нашим омолаживающим кремом для лица и век Darimay. " +
            "Этот продукт создан для тех, кто стремится вернуть коже упругость, свежесть и здоровое сияние. " +
            "Наша инновационная формула, обогащенная пептидами, антиоксидантами, NUФ-комплексом, гиалуроновой кислотой, " +
            "пантенолом, витаминами F и E, обеспечивает коже питание, защиту и глубокое увлажнение, " +
            "необходимые для восстановления и замедления признаков старения.",
        link: "https://www.ozon.ru/product/darimay-omolazhivayushchiy-krem-dlya-litsa-i-vek-s-peptidami-antioksidantami-nuf-ot-morshchin-1731390411",
        rating: "4.9",
        review: "325 отзывов",
        imgFile: "photo_1.png",
        bgFile: "bg_photo_1.png",
        skinNeeds:"Крем подойдет всем типам кожи, обезвоженной, раздраженной, против борьбы с возрастными изменениями, " +
            "в период восстановления после пилингов.",
        compound:"Water, C12-16 Alcohols, NMF (glycerin, betaine, sodium PCA, sorbitol,  serine, glycine, glutamic acid, " +
            "alanine, lysine, arginine, threonine,  proline), c12-13 alkyl lactate, Peptide- Complex (glycerin, water,  " +
            "hydroxypropyl cyclodextrin, palmitoyl tripeptide-38), panthenol,  biosaccharide gum-1, caprylic/capric " +
            "triglyceride,  coco-caprylate/caprate, hydrogenated lecithin, palmitic acid,  troxerutin, persea gratissima " +
            "(avocado) oil, dL–alpha tocopheryl  acetate, butyrospermum parkii butter, squalane, cetearyl alcohol,  " +
            "phenoxyethanol and ethylhexylglycerin, allantoin, Borealine Expert  (glycerin (and) acer rubrum extract), " +
            "Borealine Protect (glycerin (and)  picea mariana bark extract), linoleic acid, linolenic acid, arachidonic  " +
            "acid, carbomer, hyaluronic acid SLMW, xanthan gum, aminomethylpropanol.",
        info: {
            name:"Восстанавливающий крем для лица и век с церамидами, НУФ и пантенолом",
            advertising: "Откройте для себя секрет безупречной кожи с нашим уникальным восстанавливающим кремом для лица и век. " +
                "Этот продукт создан для тех, кто стремится вернуть своей коже молодость, упругость и здоровое сияние. " +
                "Наша формула, обогащенная церамидами, пантенолом и экстрактами натуральных ингредиентов, " +
                "дарит вашей коже весь спектр необходимых питательных веществ и увлажнения.",
            advantages: "Основные преимущества",
            descriptionAdvantages: "- Церамидами для защиты: Церамиды активно восстанавливают защитный барьер кожи, " +
                "укрепляют ее и предотвращают потерю влаги. В результате ваша кожа становится более устойчивой к внешним " +
                "воздействиям и агрессивным факторам окружающей среды.- Пантенол для глубокого увлажнения: " +
                "Пантенол славится своими увлажняющими и заживляющими свойствами. " +
                "Он проникает в глубокие слои кожи, способствуя её восстановлению и улучшая текстуру. " +
                "Ваша кожа станет заметно более гладкой и ухоженной уже после первых применений.",
            choice: "Почему стоит выбрать наш крем",
            choiceAdvantages: "Мы заботимся о вашем здоровье и красоте. Продукт прошел дерматологические тесты и подходит для всех типов кожи, " +
                "включая чувствительную. Легкая текстура крема быстро впитывается, не оставляя жирного блеска, " +
                "а его нежный аромат подарит вам удовольствие от ухода. Используйте крем ежедневно, " +
                "чтобы наслаждаться результатами – ваша кожа будет выглядеть свежей и молодой!",
            way: "Способ применения",
            wayAdvantages: "Наносите крем на очищенную кожу лица и век легкими массажными движениями. " +
                "Для достижения максимального эффекта рекомендуется использовать крем дважды в день – утром и вечером. " +
                "Не забывайте, что регулярность – залог успешного результата! Подарите своей коже заботу, " +
                "которую она заслуживает. Сделайте шаг к идеальной коже с нашим восстанавливающим кремом уже сегодня!"
        }
    },
    {
        id: 2,
        title: "Церамиды",
        subtitle: "Восстанавливающий крем для лица с церамидами",
        weight: "30 мл",
        description: "Восстанавливающий крем для лица и век с церамидами, пантенолом и NUФ-комплексом. " +
            "Увлажняет, питает и укрепляет кожу, не перегружая её. Идеален для чувствительной кожи, быстро впитывается, " +
            "подходит для ежедневного ухода. Натуральный состав и легкая текстура — всё, что нужно для здорового сияния кожи.",
        link: "https://www.ozon.ru/product/darimay-vosstanavlivayushchiy-krem-dlya-litsa-i-vek-s-tseramidami-nuf-pantenolom-i-1136886739",
        rating: "4.9",
        review: "325 отзывов",
        imgFile: "photo_2.png",
        bgFile: "bg_photo_2.png",
        skinNeeds:"Крем подойдет всем типам кожи, обезвоженной, раздраженной, против борьбы с возрастными изменениями, " +
            "в период восстановления после пилингов.",
        compound:"Water, c12-16 alcohols, NMF (glycerin, betaine, sodium PCA, sorbitol,  serine, glycine, glutamic acid, " +
            "alanine, lysine, arginine, threonine,  proline), Ceramide Complex (ceramide 1, ceramide 2, ceramide 3, " +
            "ceramide 6 II, butylene glycol, hydrogenated lecithin, caprylic/capric  glycerides polyglyceryl-10 esters, " +
            "pentylene glycol, water), c12-13  alkyl lactate, panthenol, caprylic/capric triglyceride, biosaccharide  " +
            "gum-1, coco-caprylate/caprate, troxerutin, palmitic acid, persea  gratissima (avocado) oil, dL–alpha tocopheryl " +
            "acetate, squalane,  butyrospermum parkii butter, tocopheryl acetate, cetearyl alcohol,  phenoxyethanol and " +
            "ethylhexylglycerin, allantoin, acer rubrum extract,  linoleic acid, linolenic acid, arachidonic acid, carbomer, " +
            "hyaluronic  acid SLMW, xanthan gum, aminomethylpropanol.",
        info: {
            name:"Восстанавливающий крем для лица и век с церамидами, НУФ и пантенолом",
            advertising: "Откройте для себя секрет безупречной кожи с нашим уникальным восстанавливающим кремом для лица и век. " +
                "Этот продукт создан для тех, кто стремится вернуть своей коже молодость, упругость и здоровое сияние. " +
                "Наша формула, обогащенная церамидами, пантенолом и экстрактами натуральных ингредиентов, " +
                "дарит вашей коже весь спектр необходимых питательных веществ и увлажнения.",
            advantages: "Основные преимущества",
            descriptionAdvantages: "- Церамидами для защиты: Церамиды активно восстанавливают защитный барьер кожи, " +
                "укрепляют ее и предотвращают потерю влаги. В результате ваша кожа становится более устойчивой к внешним " +
                "воздействиям и агрессивным факторам окружающей среды.- Пантенол для глубокого увлажнения: " +
                "Пантенол славится своими увлажняющими и заживляющими свойствами. " +
                "Он проникает в глубокие слои кожи, способствуя её восстановлению и улучшая текстуру. " +
                "Ваша кожа станет заметно более гладкой и ухоженной уже после первых применений.",
            choice: "Почему стоит выбрать наш крем",
            choiceAdvantages: "Мы заботимся о вашем здоровье и красоте. Продукт прошел дерматологические тесты и подходит для всех типов кожи, " +
                "включая чувствительную. Легкая текстура крема быстро впитывается, не оставляя жирного блеска, " +
                "а его нежный аромат подарит вам удовольствие от ухода. Используйте крем ежедневно, " +
                "чтобы наслаждаться результатами – ваша кожа будет выглядеть свежей и молодой!",
            way: "Способ применения",
            wayAdvantages: "Наносите крем на очищенную кожу лица и век легкими массажными движениями. " +
                "Для достижения максимального эффекта рекомендуется использовать крем дважды в день – утром и вечером. " +
                "Не забывайте, что регулярность – залог успешного результата! Подарите своей коже заботу, " +
                "которую она заслуживает. Сделайте шаг к идеальной коже с нашим восстанавливающим кремом уже сегодня!"
        }
    },
    {
        id: 3,
        title: "Уход для лица",
        subtitle: "Крем-гель для умывания с пантенолом",
        weight: "150 мл",
        description: "Подарите своей коже комфортное очищение, к которому она будет стремиться каждый день. " +
            "Очищающий крем-гель Darimay с пантенолом создан для тех, кто ищет мягкий, " +
            "но эффективный способ избавиться от загрязнений, при этом сохранив ощущение увлажнённости, " +
            "гладкости и комфорта уже с первого применения. Он деликатно удаляет излишки себума, пыль и остатки макияжа, " +
            "не нарушая естественный защитный барьер и не провоцируя сухость или стянутость.",
        link: "https://www.ozon.ru/product/darimay-ochishchayushchiy-krem-gel-dlya-umyvaniya-c-pantenolom-dlya-chuvstvitelnoy-kozhi-2524523954",
        rating: "4.9",
        review: "325 отзывов",
        imgFile: "photo_3.png",
        bgFile: "bg_photo_3.png",
        skinNeeds:"Крем подойдет всем типам кожи,",
        compound:"Aqua, Acrylates Copolymer, Polyglyceryl-3 Cocoate, Sorbitan Stearate, Sodium Cocoyl Glutamate, " +
            "VP/DMAPA Acrylates Copolymer, Cocamidopropyl Betaine, Vitis Vinifera (Grape) Seed Oil, Panthenol, " +
            "Biosaccharide Gum-1, Trehalose, Decyl Glucoside, Persea Gratissima (Avocado) Oil, Butyrospermum Parkii " +
            "(Shea) Butter, Phenoxyethanol, Ethylhexylglycerin, Hydroxyethylcellulose, Parfum, Citric Acid.",
        info: {
            name:"Восстанавливающий крем для лица и век с церамидами, НУФ и пантенолом",
            advertising: "Откройте для себя секрет безупречной кожи с нашим уникальным восстанавливающим кремом для лица и век. " +
                "Этот продукт создан для тех, кто стремится вернуть своей коже молодость, упругость и здоровое сияние. " +
                "Наша формула, обогащенная церамидами, пантенолом и экстрактами натуральных ингредиентов, " +
                "дарит вашей коже весь спектр необходимых питательных веществ и увлажнения.",
            advantages: "Основные преимущества",
            descriptionAdvantages: "- Церамидами для защиты: Церамиды активно восстанавливают защитный барьер кожи, " +
                "укрепляют ее и предотвращают потерю влаги. В результате ваша кожа становится более устойчивой к внешним " +
                "воздействиям и агрессивным факторам окружающей среды.- Пантенол для глубокого увлажнения: " +
                "Пантенол славится своими увлажняющими и заживляющими свойствами. " +
                "Он проникает в глубокие слои кожи, способствуя её восстановлению и улучшая текстуру. " +
                "Ваша кожа станет заметно более гладкой и ухоженной уже после первых применений.",
            choice: "Почему стоит выбрать наш крем",
            choiceAdvantages: "Мы заботимся о вашем здоровье и красоте. Продукт прошел дерматологические тесты и подходит для всех типов кожи, " +
                "включая чувствительную. Легкая текстура крема быстро впитывается, не оставляя жирного блеска, " +
                "а его нежный аромат подарит вам удовольствие от ухода. Используйте крем ежедневно, " +
                "чтобы наслаждаться результатами – ваша кожа будет выглядеть свежей и молодой!",
            way: "Способ применения",
            wayAdvantages: "Наносите крем на очищенную кожу лица и век легкими массажными движениями. " +
                "Для достижения максимального эффекта рекомендуется использовать крем дважды в день – утром и вечером. " +
                "Не забывайте, что регулярность – залог успешного результата! Подарите своей коже заботу, " +
                "которую она заслуживает. Сделайте шаг к идеальной коже с нашим восстанавливающим кремом уже сегодня!"
        }
    }
].map(item => {
    const img = new URL(`../assets/img/${item.imgFile}`, import.meta.url).href;
    const bg = new URL(`../assets/img/${item.bgFile}`, import.meta.url).href;
    const webp1x = new URL(`../assets/img/${item.imgFile}?format=webp&width=400`, import.meta.url).href;
    const webp2x = new URL(`../assets/img/${item.imgFile}?format=webp&width=800`, import.meta.url).href;
    const fallback = new URL(`../assets/img/${item.imgFile}?width=400`, import.meta.url).href;

    return {
        ...item,
        img,
        bg,
        webp1x,
        webp2x,
        fallback
    };
});
